In [2]:
import numpy as np
import pandas as pd

csv
excel
html
sql

In [3]:
pwd

'd:\\Abhay\\Data-Science-and-machine-learning\\Udemy\\pandas'

In [4]:
pd.read_csv('example.csv')

   Unnamed: 0    A    B  C  D
0           0  foo  one  x  1
1           1  foo  one  y  3
2           2  foo  two  x  2
3           3  bar  two  y  5
4           4  bar  onw  x  4
5           5  bar  onw  y  1

In [5]:
df=pd.read_csv('example.csv')

In [6]:
df

   Unnamed: 0    A    B  C  D
0           0  foo  one  x  1
1           1  foo  one  y  3
2           2  foo  two  x  2
3           3  bar  two  y  5
4           4  bar  onw  x  4
5           5  bar  onw  y  1

In [7]:
df.to_csv('09_output',index=False)

In [8]:
df.to_excel('09_excel.xlsx',index=False)

In [9]:
pd.read_csv('09_output')

   Unnamed: 0    A    B  C  D
0           0  foo  one  x  1
1           1  foo  one  y  3
2           2  foo  two  x  2
3           3  bar  two  y  5
4           4  bar  onw  x  4
5           5  bar  onw  y  1

In [10]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\abhay\appdata\local\programs\python\python313\lib\site-packages (2.0.2)Note: you may need to restart the kernel to use updated packages.

In [11]:
pd.read_excel('fake.xlsx')

    S.No. College No.  Roll No.  Enroll No.  Gender     Cat.
0     NaN         NaN       NaN         NaN     NaN      NaN
1     1.0     23CSE01       NaN         NaN    MALE  GENERAL
2     2.0     23CSE02       NaN         NaN  FEMALE      OBC
3     3.0     23CSE03       NaN         NaN    MALE      OBC
4     4.0     23CSE04       NaN         NaN    MALE      OBC
5     5.0     23CSE05       NaN         NaN    MALE  GENERAL
6     6.0     23CSE06       NaN         NaN    MALE      OBC
7     7.0     23CSE07       NaN         NaN    MALE  GENERAL
8     8.0     23CSE08       NaN         NaN    MALE      OBC
9     9.0     23CSE09       NaN         NaN  FEMALE  GENERAL
10   10.0     23CSE10       NaN         NaN    MALE  GENERAL
11   11.0     23CSE11       NaN         NaN    MALE  GENERAL
12   12.0     23CSE12       NaN         NaN    MALE      OBC
13   13.0     23CSE13       NaN         NaN    MALE       ST
14   14.0     23CSE14       NaN         NaN    MALE      OBC
15   15.0     23CSE15       NaN         NaN    MALE      OBC
16   16.0     23CSE16       NaN         NaN    MALE      OBC
17   17.0     23CSE17       NaN         NaN    MALE  GENERAL
18   18.0     23CSE18       NaN         NaN    MALE  GENERAL
19   19.0     23CSE19       NaN         NaN    MALE      OBC
20   20.0     23CSE20       NaN         NaN    MALE  GENERAL
21   21.0     23CSE21       NaN         NaN  FEMALE      OBC
22   22.0     23CSE22       NaN         NaN    MALE  GENERAL
23   23.0     23CSE23       NaN         NaN  FEMALE      OBC
24   24.0     23CSE24       NaN         NaN  FEMALE  GENERAL
25   25.0     23CSE25       NaN         NaN    MALE  GENERAL
26   26.0     23CSE26       NaN         NaN    MALE      OBC
27   27.0     23CSE27       NaN         NaN    MALE      OBC
28   28.0     23CSE28       NaN         NaN    MALE      OBC
29   29.0     23CSE29       NaN         NaN    MALE       SC
30   30.0     23CSE30       NaN         NaN    MALE      OBC
31   31.0     23CSE31       NaN         NaN    MALE  GENERAL
32   32.0     23CSE32       NaN         NaN  FEMALE      OBC
33   33.0     23CSE33       NaN         NaN    MALE      OBC
34   34.0     23CSE34       NaN         NaN    MALE      OBC
35   35.0     23CSE35       NaN         NaN  FEMALE      OBC
36   36.0     23CSE36       NaN         NaN    MALE       SC

In [12]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\abhay\appdata\local\programs\python\python313\lib\site-packages (3.1.5)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: et-xmlfile in c:\users\abhay\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)

In [13]:
pd.read_excel('fake.xlsx')

    S.No. College No.  Roll No.  Enroll No.  Gender     Cat.
0     NaN         NaN       NaN         NaN     NaN      NaN
1     1.0     23CSE01       NaN         NaN    MALE  GENERAL
2     2.0     23CSE02       NaN         NaN  FEMALE      OBC
3     3.0     23CSE03       NaN         NaN    MALE      OBC
4     4.0     23CSE04       NaN         NaN    MALE      OBC
5     5.0     23CSE05       NaN         NaN    MALE  GENERAL
6     6.0     23CSE06       NaN         NaN    MALE      OBC
7     7.0     23CSE07       NaN         NaN    MALE  GENERAL
8     8.0     23CSE08       NaN         NaN    MALE      OBC
9     9.0     23CSE09       NaN         NaN  FEMALE  GENERAL
10   10.0     23CSE10       NaN         NaN    MALE  GENERAL
11   11.0     23CSE11       NaN         NaN    MALE  GENERAL
12   12.0     23CSE12       NaN         NaN    MALE      OBC
13   13.0     23CSE13       NaN         NaN    MALE       ST
14   14.0     23CSE14       NaN         NaN    MALE      OBC
15   15.0     23CSE15       NaN         NaN    MALE      OBC
16   16.0     23CSE16       NaN         NaN    MALE      OBC
17   17.0     23CSE17       NaN         NaN    MALE  GENERAL
18   18.0     23CSE18       NaN         NaN    MALE  GENERAL
19   19.0     23CSE19       NaN         NaN    MALE      OBC
20   20.0     23CSE20       NaN         NaN    MALE  GENERAL
21   21.0     23CSE21       NaN         NaN  FEMALE      OBC
22   22.0     23CSE22       NaN         NaN    MALE  GENERAL
23   23.0     23CSE23       NaN         NaN  FEMALE      OBC
24   24.0     23CSE24       NaN         NaN  FEMALE  GENERAL
25   25.0     23CSE25       NaN         NaN    MALE  GENERAL
26   26.0     23CSE26       NaN         NaN    MALE      OBC
27   27.0     23CSE27       NaN         NaN    MALE      OBC
28   28.0     23CSE28       NaN         NaN    MALE      OBC
29   29.0     23CSE29       NaN         NaN    MALE       SC
30   30.0     23CSE30       NaN         NaN    MALE      OBC
31   31.0     23CSE31       NaN         NaN    MALE  GENERAL
32   32.0     23CSE32       NaN         NaN  FEMALE      OBC
33   33.0     23CSE33       NaN         NaN    MALE      OBC
34   34.0     23CSE34       NaN         NaN    MALE      OBC
35   35.0     23CSE35       NaN         NaN  FEMALE      OBC
36   36.0     23CSE36       NaN         NaN    MALE       SC

In [14]:
data = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list')

In [16]:
type(data)

list

In [17]:
data

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [18]:
data[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [20]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [ ]:
from sqlalchemy import create_engine